package com.teamwork.telegrambotanimalshelter.constant;

public class Constants {

    public static final String WELCOME = """
            В сложные время лучшее, что можно сделать, – помочь другим. Например, стать другом для четвероногого пушистика.
            Здесь Вы точно найдете ту самую собачку или того самого кота.
            """;
    public static final String SHELTER_INFO = """
            Приют существует уже 15 лет. Сколько за это время удалось пристроить животных, точно посчитать не сможет никто. 
            Здесь живут взрослые собаки и кошки, щенки и котята. Все они привиты, стерилизованы и кастрированы. 
            Вы заранее можете узнать правила знакомства с животными в приюте,  как подготовится к приёму пушистика у себя дома, 
            какие документы нужны чтобы забрать понравившееся животное
           
            """;
    public static final String DOG_CARE_RULES = """
            1. Собака должна быть накормлена
            2
            """;
    public static final String GUARDS_INFO = """
            Номер: +7 999 111 11 11
            Имя: Петр
            """;
    public static final String TB_GUIDELINES = """
            1. Правила безопасности
            2. Запрещается:
            3. •	Самостоятельно открывать выгулы и вольеры без разрешения работника приюта.
               •	Кормить животных. Угощения разрешены только постоянным опекунам и волонтерам.
               •	Оставлять после себя мусор на территории приюта и прилегающей территории.
               •	Подходить близко к вольерам и гладить собак через сетку на выгулах. Животные могут быть агрессивны!
               •	Кричать, размахивать руками, бегать между будками или вольерами, пугать и дразнить животных.
               •	Посещение приюта для детей дошкольного и младшего школьного возраста без сопровождения взрослых.
               •	Нахождение на территории приюта детей среднего и старшего школьного возраста без  сопровождения взрослых.
               •	Самостоятельно заходить в кошатник без разрешения сотрудников приюта.
               •	Посещение приюта в состоянии алкогольного, наркотического опьянения.
            """;

    public static final String LIST_OF_REASONS = """
            1.Животные в приюте очень радуются гостям и могут на Вас прыгнуть. Что бы не бояться испачкаться и не переживать возьмите с собой комплект сменной одежды и обуви.\s
            2.Животных угощать запрещено.
            3.В приюте обязательно слушайте, что говорит работник или волонтер. Никогда не открывайте калитки вольеров без разрешения!\s
            """;
    public static final String REQUIRED_DOCUMENTS = """
            1.Паспорт потенциального владельца,
            2.Фотографии квартиры или загородного дома где будет жить животное.
            3.Анкета (заполняется в приюте)
            """;

    public static final String DOG_CARRIAGE = """
            1. Для перевозки собки Вам потребуется намордник и поводок, плюс покрывало на сидения, пакеты и влажные салфетки.
            2. Для перевозки кошки подготовьте переноску по размеру животного. 
            3. Если время перевозки займет более 1 часа, приготовьте поилку и воду.
            """;

    public static final String PUPPY_SETUP = """
            Что понадобится щенку  в новом доме?
            1.Лежанка.
            2.Две миски: для воды и еды.
            3.Корм. По выбору корма можно проконсультироваться в приюте.
            4.Игрушки.
            5.Инструменты и аксессуары для груминга: когтерез, щетка, лосьон для чистки глаз и ушей, шампунь 
            и кондиционер для щенков, впитывающее полотенце.
            6.Аптечка. Базовая комплектация: термометр, самофиксирующиеся бинты, стерильные салфетки и 
            самофиксирующийся, дезинфицирующие средства без спирта, средство от диареи (сорбенты), 
            ранозаживляющая мазь, противопаразитарные средства, лосьон для чистки ушей и глаз.
            7.Обязательно узнайте адреса и телефоны нескольких ближайших ветеринарных клиник,
            8.Аксессуары для выгула: ошейник, поводок, шлейка, адресник. 
            При необходимости теплая одежда для прогулок и обувь.
            """;

//    public static final String ADULT_DOG_SETUP = """
//            Что понадобится собаке в новом доме?
//            1.Лежанка.
//            2.Две миски: для воды и еды.
//            3.Корм. По выбору корма можно проконсультироваться в приюте.
//            4.Игрушки.
//            5.Инструменты и аксессуары для груминга: когтерез, щетка, лосьон для чистки глаз и ушей, шампунь
//            и кондиционер для щенков, впитывающее полотенце.
//            6.Аптечка. Базовая комплектация: термометр, самофиксирующиеся бинты, стерильные салфетки и
//            самофиксирующийся, дезинфицирующие средства без спирта, средство от диареи (сорбенты),
//            ранозаживляющая мазь, противопаразитарные средства, лосьон для чистки ушей и глаз.
//            7.Обязательно узнайте адреса и телефоны нескольких ближайших ветеринарных клиник,
//            8. Для выгула: ошейник, при необходимости намордник, поводок, адресник.
//            При необходимости теплая одежда для прогулок и обувь.
//            """;

    public static final String ARRANGEMENT_OF_DOG_WITH_DISABILITIES = """
            Как организовать для питомца-инвалида максимально комфортную и безопасную среду.
            1. Уход за слепыми зверями.
            Если в доме содержится любимец с проблемным зрением, рекомендуется как можно реже
            проводить перестановку мебели, так как это затруднит его ориентацию в пространстве.
            Также не стоит без особой необходимости менять местоположение мисок с водой и кормом,
            подстилки, лотка. На полу и в пределах досягаемости нельзя оставлять вещи, в которых
            питомец может запутаться (например, одежду, полиэтиленовые пакеты-майки и т.д.).
            Доступ к лестнице, камину, нагревательным приборам и т.д. должен быть заблокирован.

            2. Уход за питомцами с ограниченной подвижностью.
            В первую очередь, необходимо обеспечить удобство передвижения по территории постоянного проживания.
            Если питомец волочит заднюю часть туловища, необходимо убрать с пола ковры, которые могут
            препятствовать движению. При этом для защиты конечностей от образования мозолей потребуется
            приобрести специальные фиксирующиеся накладки.
            Решить проблему туалета помогут специальные подгузники и одноразовые пеленки.
            В некоторых случаях для собаки или кота можно подобрать подходящую инвалидную коляску или ходунки.
            3. Важно! Для слепых или ограниченно подвижных животных категорически запрещен свободный выгул.
            4. Более подробные рекомендации можно получить у ветеринара.
             """;

    public static final String RULES_FOR_DATING_A_DOG = """
            Почему важно построить первоначальный контакт с собакой и как это сделать.
            1.	Разговаривайте со своей собакой.
            У собак хорошо развит слух, кроме того, они способны запоминать слова и
            связывать их с определенными явлениями.
            Собаки способны понимать, по меньшей мере, общий смысл человеческой речи.
            Люди, которые часто разговаривают со своей собакой, замечают, что собака начинает
            более осознанно реагировать на их слова и даже целые фразы.
            2.	 Следите за своими эмоциями.
            Быть членом общества — это значит уметь чутко реагировать на сигналы других членов
            своей группы и адекватно отвечать им.
            Собака ориентируется на эмоциональное состояние хозяина и других членов семьи.
            Применяя наказания, хозяин тоже создает эмоции — только негативные.
            В большом количестве эти эмоции разрушают контакт.
             """;

    public static final String CYNOLOGIST_ADVICE = """
            1.	Наблюдайте за выражением внутреннего состояния собаки и приводите его в норму.
             Внутреннее состояние собаки можно очень просто определить по ее сигналам. 
             Самые важные из них – сигналы примирения и симптомы стресса.
             - Если ваша собака неспокойна, постарайтесь сделать все возможное, чтобы успокоить ее. 
             Проще всего это сделать, если вы обратитесь к ней спокойным, дружеским тоном. 
             Нередко помогают лакомства или ласка.
             - На прогулке наблюдайте, с каким чувством она приближается к другой собаке. 
             Если моя собака или встречная собака показывает сигналы примирения или даже 
             симптомы стресса, старайтесь успокоить ситуацию. Для этого есть несколько вариантов реакции:
             Встать между своей собакой и собакой, которая к нам приближается;
             Остановиться на обочине дороги как можно дальше от приближающейся собаки и подождать, 
             пока она пройдет мимо;
             - Переключить внимание собаки на себя и в таком состоянии пройти мимо другой собаки;
             - После неприятной встречи старатесь сделать своей собаке что-то приятное: дать ей возможность 
             понюхать следы прошедшей мимо собаки, пописать на ее метку, поесть траву, поваляться в траве 
             или снять стресс каким-то другим действием.
             - Постарайтесь заранее понять, в каких ситуациях ваша собака начинает нервничать, 
             и какими методами можно ее быстро успокоить.
            2.	Учитывайте желания собаки.
             Не заставляйте собаку всегда делать только то, что хотите вы сами!
             Удовлетворить желания собаки очень просто:
             Предоставьте собаке выбор
             Например, если вы идете на прогулку, пронаблюдайте, в какую сторону хочет пойти ваша собака. 
             Может быть, она почувствовала в той стороне какой-то особый запах? Может быть, ее заинтересовали 
             какие-то места, к которым ведет новая дорога? Может быть, ее отпугнул от привычного пути 
             какой-то звук? Может быть, ей просто скучно все время ходить по одной и той же дороге каждый день?
             - Научитесь понимать сигналы, которыми собака выражает свои желания
            3. Гибко реагируйте на поведение собаки
             Каждая собака – индивидуум. Поведение собаки – это вовсе не спонтанный выстрел из ниоткуда. 
             Это результат гибкого взаимодействия внутреннего состояния собаки и окружающей среды.
            4. Ставьте границы допустимого без использования наказания
             Воспитание собаки невозможно пускать на самотек.
             Если же вам все-таки нужно подкорректировать поведение собаки, вы можете:
             - Обучить собаку альтернативным действиям (например, собаку приучают приносить игрушку 
             вместо того, чтобы прыгать на гостя);
             Лишить успеха от нежелательного действия (например, у собаки отбирают украденный со 
             стола кусок колбасы);
             Проигнорировать нежелательное действие (например, навязчивую попытку привлечь внимание);
             Остановить нежелательное действие различными способами, например, сигналом примирения 
             «разделение», «отворачивание», отзыв в сторону и т.д. 
            5.  Введите сигналы, которые вам помогут строить контакт
             Если хозяин любит свою собаку и заботится о ней, социальный контакт складывается сам по себе,
              в ходе повседневного общения. Этому во многом способствует генетическая предрасположенность
              собак строить контакт с людьми, искать его. Собаки от природы испытывают сильный интерес к людям. 
              Они склонны ориентироваться на людей, способны понимать их эмоции и указательные жесты и 
              направление взгляда. Тем не менее, полезно усилить это качество с помощью специальных упражнений.
              Указательный жест пальцем.
              Ведущая рука.
              Контакт глазами.
              Ритуалы повседневной жизни: ритуал встречи, ритуал прощания, ритуал перемирия,  
              Научите собаку задавать вам вопросы.
              Например, она будет поднимать на вас глаза, спрашивая, куда мы идем.
            6. На прогулке
             Во время прогулки общайтесь со своей собакой, 
             словно вы гуляете с другим членом своей семьи. Тогда собака будет следовать за вами более осмысленно.
             Как сделать из собаки приятного спутника:
             - Возьмите легкий поводок длиной от 3 метров.
             - Расслабьте мышцы рук и настройтесь на приятную прогулку.
            7. Дома и в гостях
               Показывайте своей собаке все предметы, которые ее заинтересуют
               Позволяйте ей быть рядом с вами и принимать участие в ваших делах
               Создайте ей уютное место, где бы она могла отдыхать без помех
               Радостно здоровайтесь с собакой при встрече со своей собакой.
            10. Ежедневно уделяйте собаке внимание – играйте с ней и ласкайте ее.
     
             """;
}
