package com.teamwork.telegrambotanimalshelter.constant;

public class Constants {
    public static final Long VOLUNTEER_CAT_SHELTER = 1141300024L;
    public static final Long VOLUNTEER_DOG_SHELTER = 472854123L;
    public static final String VOLUNTEER_INVITE = "https://t.me/BogdanovaDiana";

    public static final String WELCOME = """
            В сложные время лучшее, что можно сделать, – помочь другим. Например, стать другом для четвероногого пушистика.
            Здесь Вы точно найдете ту самую собачку или того самого кота.
            """;
    public static final String CAT_SHELTER_INFO = """
            Наш приют для котов и котят был основан в 2015 году.
            Тогда основатель приюта уверенно решил для себя, что доброта делает наш мир намного лучше!
            И теперь вы тоже можете совершить большое добро, приютив нового друга!
            Всё наше кошачье семейство привито, кастрировано, стерилизовано и обработано от паразитов.
            Для получения подробной информации о приюте, правилах и особенностях знакомства, воспользуйтесь подробным меню нашего бота!
            При возникновении вопросов вы всегда можете обратиться к нашим волонтерам!
            """;

    public static final String DOG_SHELTER_INFO = """
            Наш приют для собак и щенков был основан в 2015 году.
            Тогда основатель приюта уверенно решил для себя, что доброта делает наш мир намного лучше!
            И теперь вы тоже можете совершить большое добро, приютив нового друга!
            Всё наше собачье семейство привито, кастрировано, стерилизовано и обработано от паразитов.
            Для получения подробной информации о приюте, правилах и особенностях знакомства, воспользуйтесь подробным меню нашего бота!
            При возникновении вопросов вы всегда можете обратиться к нашим волонтерам!
            """;

    public static final String TRANSPORTATION_OF_THE_ANIMAL = """
             1. Используйте только рекомендованные переноски для перевозки животных. Они должны иметь достаточное пространство для комфортного передвижения и хорошую вентиляцию.
             2. Убедитесь, что ваш питомец имеет все необходимые прививки и медицинские документы, прежде чем перевозить его.
             3. Дайте питомцу привыкнуть к переноске, в котором он будет перевозиться, чтобы он чувствовал себя более комфортно.
             4. Никогда не оставляйте своего питомца в переноске в течение продолжительного времени, даже если это возможно.
             5. Если вы путешествуете на большие расстояния, сделайте паузы для того, чтобы ваш питомец смог выйти из переноски, выпить воды и растянуть ноги.
             6. Проверяйте своего питомца регулярно во время поездки, чтобы убедиться в его комфорте и безопасности.
            """;

    public static final String ANIMAL_DATING_RULES = """
            1. Никогда не подходите к животному сзади или сверху, это может их напугать и вызвать агрессивную реакцию.
            2. Поговорите с сотрудниками приюта, чтобы узнать, какое поведение у этого животного, и как наилучшим образом общаться с ним.
            3. Если вы уже имеете домашних животных, принесите их с собой для знакомства с новым приемлемым другом.
            4. Не протягивайте руки и не приближайтесь, если животное выглядит напуганным или злым.
            5. Не оставляйте детей без присмотра рядом с животными, особенно если они незнакомы друг с другом.
            6. Помните, что животное может быть стрессованным из-за изменения условий, и знакомство может потребовать времени и терпения.
            """;

    public static final String LIST_OF_REASON_FOR_DENY = """
            1. Неудовлетворительные условия проживания. Если дом или окружающая среда не соответствуют нуждам животного, приют может отказать в передаче животного.
            2. Недостаточный доход. Если потенциальный владелец не в состоянии содержать животное из-за ограниченных финансовых возможностей, приют может отказать в передаче животного.
            3. Недостаточно времени. Если человек не может уделять достаточно времени на заботу о животном, приют может отказать в передаче животного.
            4. Неудовлетворительное здоровье. Если здоровье человека не позволяет ухаживать за животным, приют может отказать в передаче животного.
            5. Некомпетентность в обращении с животными. Если человек не умеет обращаться с животными и не может предоставить достаточную заботу и заботу о животном, приют может отказать в передаче животного.
            6. Неидеальное окружение. Если приют не уверен в безопасности животного в новом окружении, приют может отказать в передаче животного.
            7. Несоответствие возраста животного. Приют может отказать в передаче животного, если животное слишком молодое, чтобы быть переданным в домашний питомник, или слишком старое, чтобы было принято на ответственное содержание.
            8. Несоответствие правилам приюта. Если житель не соответствует правилам приюта или не предоставляет достаточно информации и документов, приют может отказать в передаче животного.
            """;

    public static final String RECOMMENDATIONS_HOME_IMPROVEMENT_KITTEN_PUPPY = """
            1. Создайте безопасное место для животного: выделите часть дома для животного, где он может чувствовать себя в безопасности, включая место для сна, игры и еды.
            2. Закройте доступ к опасным зонам: закройте двери и окна, которые могут быть опасными для животных, например, на балкон или на улицу.
            3. Уберите ядовитые растения и опасные предметы: удалите все растения, которые могут быть ядовитыми для животных, а также уберите опасные предметы, которые могут быть глотнуты или повреждены.
            4. Подготовьте место для туалета: подготовьте место для туалета, чтобы ваше животное знало, где ему нужно справлять нужду.
            5. Подготовьте игрушки: обеспечьте животное игрушками, чтобы оно чувствовало себя занятым и развлеченным, а также чтобы оно не грызло мебель и другие вещи.
            6. Подготовьте корм и воду: установите миски для корма и воды в спокойном месте, где животное может легко добраться до них.
            7. Установите место для сна: установите место для сна, чтобы ваше животное имело спокойное место для отдыха.
            8. Убедитесь, что дом достаточно просторный и светлый: животные не любят тесноты и темноты, поэтому убедитесь, что ваш дом достаточно просторный и светлый.
            """;

    public static final String RECOMMENDATIONS_HOME_IMPROVEMENT_ADULT_ANIMAL = """
            1. Создайте комфортное место для вашего животного: установите место для сна, чтобы ваше животное имело спокойное место для отдыха.
            2. Убедитесь, что дом достаточно просторный и светлый: животные не любят тесноты и темноты, поэтому убедитесь, что ваш дом достаточно просторный и светлый.
            3. Закройте доступ к опасным зонам: закройте двери и окна, которые могут быть опасными для животных, например, на балкон или на улицу.
            4. Подготовьте место для туалета: если ваше животное не знает, где ему нужно справлять нужду, подготовьте ему место для туалета и научите его этому.
            5. Уберите ядовитые растения и опасные предметы: удалите все растения, которые могут быть ядовитыми для животных, а также уберите опасные предметы, которые могут быть глотнуты или повреждены.
            6. Обеспечьте животное игрушками: обеспечьте животное игрушками, чтобы оно чувствовало себя занятым и развлеченным, а также чтобы оно не грызло мебель и другие вещи.
            7. Свободный доступ к воде и корму: установите миски для корма и воды в спокойном месте, где животное может легко добраться до них.
            8. Убедитесь, что ваше животное получает достаточно физических и умственных упражнений: животные нуждаются в физических и умственных упражнениях, чтобы оставаться здоровыми и счастливыми, поэтому убедитесь, что вы занимаетесь с вашим животным, играете с ним и проводите время на улице.
            """;

    public static final String RECOMMENDATIONS_HOME_IMPROVEMENT_DISABLED_ANIMAL = """
            1. Сделайте дом более доступным: установите рампы или лифты, которые позволят животному подниматься и спускаться по лестнице, если необходимо.
            2. Уберите препятствия: уберите все препятствия и мебель, которая может помешать животному передвигаться по дому.
            3. Установите специальные средства передвижения: установите коляски или другие средства передвижения, которые могут помочь животному передвигаться по дому и на улице.
            4. Сделайте спальное место более удобным: обеспечьте комфортное место для сна, чтобы животное могло спокойно отдыхать и получать необходимый отдых.
            5. Установите специальный туалет: установите туалет, который легко доступен для животного и не создаст ему трудностей в использовании.
            6. Обеспечьте ограниченные зоны: установите барьеры, которые будут ограничивать доступ животного к опасным зонам, например, к лестницам или кухне, где могут быть опасные предметы.
            7. Обеспечьте животное игрушками и стимулами: обеспечьте животное игрушками и другими стимулами, чтобы оно чувствовало себя занятым и развлеченным.
            8. Организуйте двери и окна: убедитесь, что двери и окна легко открываются и закрываются, чтобы животное могло свободно передвигаться по дому.
            """;

    public static final String DOG_HANDLERS_ADVICE = """
            1. Не подходите к собаке слишком близко и не говорите с ней слишком громко. Оставайтесь спокойным и уверенным, но не доминируйте над собакой.
            2. Дайте собаке время, чтобы она осмотрелась и привыкла к вам. Не пытайтесь знакомиться с собакой сразу же.
            3. Если собака приближается к вам, не паникуйте и не отскакивайте от нее. Просто осторожно протяните руку для знакомства.
            4. Не приближайтесь к собаке сверху. Для нее это может быть угрожающим.
            5. Если собака начинает с вами играть, не дразните ее и не демонстрируйте агрессию. Играйте с ней активно и весело, но не допускайте, чтобы игры превратились в драку.
            6. Часто говорите с собакой и используйте ее имя. Награждайте ее ласками и похвалой за хорошее поведение.
            7. Старайтесь узнать о породе собаки и ее особенностях, чтобы понимать, как лучше с нею общаться.
            8. Никогда не угрожайте и не наказывайте собаку физически. Это может привести к агрессивному поведению и проблемам в будущем.
            9. Если вам не удается установить контакт с собакой, не настаивайте на этом. Попросите помощи у кинолога или другого опытного специалиста по тренировке собак.
            """;

    public static final String DOG_HANDLERS_CONTACTS = """
            1. Екатерина Смирнова
            2. +7 (999) 123-45-67
            3. Будние дни: с 7:00 до 20:00
                        
            1. Олег Петров
            2. +7 (999) 765-43-21
            3. Будние дни: с 7:00 до 20:00
                        
            1. Азамат Хайбуллин
            2. +7 (917) 123-45-67
            3. Суббота - воскресенье: с 07:00 до 20:00.
            """;

    public static final String GUARDS_INFO_CAT = """
            Номер: +7 999 111 11 11
            Имя: Петр
            """;

    public static final String GUARDS_INFO_DOG = """
            Номер: +7 999 222 22 22
            Имя: Василий
            """;

    public static final String TB_GUIDELINES = """
            Запрещается:
            • Самостоятельно открывать выгулы и вольеры без разрешения работника приюта.
            • Кормить животных. Угощения разрешены только постоянным опекунам и волонтерам.
            • Оставлять после себя мусор на территории приюта и прилегающей территории.
            • Подходить близко к вольерам и гладить собак через сетку на выгулах. Животные могут быть агрессивны!
            • Кричать, размахивать руками, бегать между будками или вольерами, пугать и дразнить животных.
            • Посещение приюта для детей дошкольного и младшего школьного возраста без сопровождения взрослых.
            • Нахождение на территории приюта детей среднего и старшего школьного возраста без  сопровождения взрослых.
            • Самостоятельно заходить в кошатник без разрешения сотрудников приюта
            • Посещение приюта в состоянии алкогольного, наркотического опьянения.
            """;

    public static final String REQUIRED_DOCUMENTS = """
            1. Паспорт потенциального владельца;
            2. Фотографии квартиры или загородного дома, где будет жить животное;
            3. Анкета (заполняется в приюте);
            4. Справка о месте работы.
            """;
}
