package com.teamwork.telegrambotanimalshelter.constant;

public class Constants {

    public static final String WELCOME = """
            В сложные время лучшее, что можно сделать, – помочь другим. Например, стать другом для четвероногого пушистика.
            Здесь Вы точно найдете ту самую собачку или того самого кота.
            """;
    public static final String CAT_SHELTER_INFO = """
            Приют существует уже 15 лет. Сколько за это время удалось пристроить животных, точно посчитать не сможет никто. 
            Здесь живут взрослые собаки и кошки, щенки и котята. Все они привиты, стерилизованы и кастрированы. 
            Вы заранее можете узнать правила знакомства с животными в приюте,  как подготовится к приёму пушистика у себя дома, 
            какие документы нужны чтобы забрать понравившееся животное
            CAAAAAAT
           
            """;

    public static final String DOG_SHELTER_INFO = """
            Приют существует уже 15 лет. Сколько за это время удалось пристроить животных, точно посчитать не сможет никто. 
            Здесь живут взрослые собаки и кошки, щенки и котята. Все они привиты, стерилизованы и кастрированы. 
            Вы заранее можете узнать правила знакомства с животными в приюте,  как подготовится к приёму пушистика у себя дома, 
            какие документы нужны чтобы забрать понравившееся животное
           DOOOOOOG
            """;

    public static final String TRANSPORTATION_OF_THE_ANIMAL = """
             1. Используйте только рекомендованные переноски для перевозки животных. Они должны иметь достаточное пространство для комфортного передвижения и хорошую вентиляцию.
             2. Убедитесь, что ваш питомец имеет все необходимые прививки и медицинские документы, прежде чем перевозить его.
             3. Дайте питомцу привыкнуть к переноске, в котором он будет перевозиться, чтобы он чувствовал себя более комфортно.
             4. Никогда не оставляйте своего питомца в переноске в течение продолжительного времени, даже если это возможно.
             5. Если вы путешествуете на большие расстояния, сделайте паузы для того, чтобы ваш питомец смог выйти из переноски, выпить воды и растянуть ноги.
             6. Проверяйте своего питомца регулярно во время поездки, чтобы убедиться в его комфорте и безопасности.
            """;

    public static final String ANIMAL_DATING_RULES = """
            1. Никогда не подходите к животному сзади или сверху, это может их напугать и вызвать агрессивную реакцию.
            2. Поговорите с сотрудниками приюта, чтобы узнать, какое поведение у этого животного, и как наилучшим образом общаться с ним.
            3. Если вы уже имеете домашних животных, принесите их с собой для знакомства с новым приемлемым другом.
            4. Не протягивайте руки и не приближайтесь, если животное выглядит напуганным или злым.
            5. Не оставляйте детей без присмотра рядом с животными, особенно если они незнакомы друг с другом.
            6. Помните, что животное может быть стрессованным из-за изменения условий, и знакомство может потребовать времени и терпения.
            """;

    public static final String LIST_OF_REASON_FOR_DENY = """
            1. Неудовлетворительные условия проживания. Если дом или окружающая среда не соответствуют нуждам животного, приют может отказать в передаче животного.
            2. Недостаточный доход. Если житель не в состоянии содержать животное из-за ограниченных финансовых возможностей, приют может отказать в передаче животного.
            3. Недостаточно времени. Если человек не может уделять достаточно времени на заботу о животном, приют может отказать в передаче животного.
            4. Неудовлетворительное здоровье. Если здоровье жителя не позволяет ухаживать за животным, приют может отказать в передаче животного.
            5. Некомпетентность в обращении с животными. Если человек не умеет обращаться с животными и не может предоставить достаточную заботу и заботу о животном, приют может отказать в передаче животного.
            6. Неидеальное окружение. Если приют не уверен в безопасности животного в новом окружении, приют может отказать в передаче животного.
            7. Несоответствие возраста животного. Приют может отказать в передаче животного, если животное слишком молодое, чтобы быть переданным в домашний питомник, или слишком старое, чтобы было принято на ответственное содержание.
            8. Несоответствие правилам приюта. Если житель не соответствует правилам приюта или не предоставляет достаточно информации и документов, приют может отказать в передаче животного.
            """;

    public static final String RECOMMENDATIONS_HOME_IMPROVEMENT_KITTEN_PUPPY = """
            1. Создайте безопасное место для животного: выделите часть дома для животного, где он может чувствовать себя в безопасности, включая место для сна, игры и еды.
            2. Закройте доступ к опасным зонам: закройте двери и окна, которые могут быть опасными для животных, например, на балкон или на улицу.
            3. Уберите ядовитые растения и опасные предметы: удалите все растения, которые могут быть ядовитыми для животных, а также уберите опасные предметы, которые могут быть глотнуты или повреждены.
            4. Подготовьте место для туалета: подготовьте место для туалета, чтобы ваше животное знало, где ему нужно справлять нужду.
            5. Подготовьте игрушки: обеспечьте животное игрушками, чтобы оно чувствовало себя занятым и развлеченным, а также чтобы оно не грызло мебель и другие вещи.
            6. Подготовьте корм и воду: установите миски для корма и воды в спокойном месте, где животное может легко добраться до них.
            7. Установите место для сна: установите место для сна, чтобы ваше животное имело спокойное место для отдыха.
            8. Убедитесь, что дом достаточно просторный и светлый: животные не любят тесноты и темноты, поэтому убедитесь, что ваш дом достаточно просторный и светлый.
            """;

    public static final String RECOMMENDATIONS_HOME_IMPROVEMENT_ADULT_ANIMAL = """
            1. Создайте комфортное место для вашего животного: установите место для сна, чтобы ваше животное имело спокойное место для отдыха.
            2. Убедитесь, что дом достаточно просторный и светлый: животные не любят тесноты и темноты, поэтому убедитесь, что ваш дом достаточно просторный и светлый.
            3. Закройте доступ к опасным зонам: закройте двери и окна, которые могут быть опасными для животных, например, на балкон или на улицу.
            4. Подготовьте место для туалета: если ваше животное не знает, где ему нужно справлять нужду, подготовьте ему место для туалета и научите его этому.
            5. Уберите ядовитые растения и опасные предметы: удалите все растения, которые могут быть ядовитыми для животных, а также уберите опасные предметы, которые могут быть глотнуты или повреждены.
            6. Обеспечьте животное игрушками: обеспечьте животное игрушками, чтобы оно чувствовало себя занятым и развлеченным, а также чтобы оно не грызло мебель и другие вещи.
            7. Свободный доступ к воде и корму: установите миски для корма и воды в спокойном месте, где животное может легко добраться до них.
            8. Убедитесь, что ваше животное получает достаточно физических и умственных упражнений: животные нуждаются в физических и умственных упражнениях, чтобы оставаться здоровыми и счастливыми, поэтому убедитесь, что вы занимаетесь с вашим животным, играете с ним и проводите время на улице.
            """;

    public static final String RECOMMENDATIONS_HOME_IMPROVEMENT_DISABLED_ANIMAL = """
            1. Сделайте дом более доступным: установите рампы или лифты, которые позволят животному подниматься и спускаться по лестнице, если необходимо.
            2. Уберите препятствия: уберите все препятствия и мебель, которая может помешать животному передвигаться по дому.
            3. Установите специальные средства передвижения: установите коляски или другие средства передвижения, которые могут помочь животному передвигаться по дому и на улице.
            4. Сделайте спальное место более удобным: обеспечьте комфортное место для сна, чтобы животное могло спокойно отдыхать и получать необходимый отдых.
            5. Установите специальный туалет: установите туалет, который легко доступен для животного и не создаст ему трудностей в использовании.
            6. Обеспечьте ограниченные зоны: установите барьеры, которые будут ограничивать доступ животного к опасным зонам, например, к лестницам или кухне, где могут быть опасные предметы.
            7. Обеспечьте животное игрушками и стимулами: обеспечьте животное игрушками и другими стимулами, чтобы оно чувствовало себя занятым и развлеченным.
            8. Организуйте двери и окна: убедитесь, что двери и окна легко открываются и закрываются, чтобы животное могло свободно передвигаться по дому.
            """;

    public static final String DOG_HANDLERS_ADVICE = """
            1. Не подходите к собаке слишком близко и не говорите с ней слишком громко. Оставайтесь спокойным и уверенным, но не доминируйте над собакой.
            2. Дайте собаке время, чтобы она осмотрелась и привыкла к вам. Не пытайтесь знакомиться с собакой сразу же.
            3. Если собака приближается к вам, не паникуйте и не отскакивайте от нее. Просто осторожно протяните руку для знакомства.
            4. Не приближайтесь к собаке сверху. Для нее это может быть угрожающим.
            5. Если собака начинает с вами играть, не дразните ее и не демонстрируйте агрессию. Играйте с ней активно и весело, но не допускайте, чтобы игры превратились в драку.
            6. Часто говорите с собакой и используйте ее имя. Награждайте ее ласками и похвалой за хорошее поведение.
            7. Старайтесь узнать о породе собаки и ее особенностях, чтобы понимать, как лучше с нею общаться.
            8. Никогда не угрожайте и не наказывайте собаку физически. Это может привести к агрессивному поведению и проблемам в будущем.
            9. Если вам не удается установить контакт с собакой, не настаивайте на этом. Попросите помощи у кинолога или другого опытного специалиста по тренировке собак.
            """;

    public static final String DOG_HANDLERS_CONTACTS = """
            1. Иван Петров
            2. +7 (999) 123-45-67
            3. Круглосуточно
                        
            1. Анна Сидорова
            2. +7 (499) 765-43-21
            3. Понедельник-пятница: с 9:00 до 18:00
                        
            1. Дмитрий Белов
            2. +7 (987) 654-32-10
            3. Понедельник, среда, пятница: с 10:00 до 20:00; вторник, четверг: с 14:00 до 22:00; суббота: с 11:00 до 18:00; воскресенье: выходной.
            """;
    public static final String DOG_CARE_RULES = """
            1. Собака должна быть накормлена
            2
            """;
    public static final String GUARDS_INFO_CAT = """
            Номер: +7 999 111 11 11
            Имя: Петр
            """;

    public static final String GUARDS_INFO_DOG = """
            Номер: +7 999 222 22 22
            Имя: Василий
            """;
    public static final String TB_GUIDELINES = """
            1. Правила безопасности
            2. Запрещается:
            3. •	Самостоятельно открывать выгулы и вольеры без разрешения работника приюта.
               •	Кормить животных. Угощения разрешены только постоянным опекунам и волонтерам.
               •	Оставлять после себя мусор на территории приюта и прилегающей территории.
               •	Подходить близко к вольерам и гладить собак через сетку на выгулах. Животные могут быть агрессивны!
               •	Кричать, размахивать руками, бегать между будками или вольерами, пугать и дразнить животных.
               •	Посещение приюта для детей дошкольного и младшего школьного возраста без сопровождения взрослых.
               •	Нахождение на территории приюта детей среднего и старшего школьного возраста без  сопровождения взрослых.
               •	Самостоятельно заходить в кошатник без разрешения сотрудников приюта.
               •	Посещение приюта в состоянии алкогольного, наркотического опьянения.
            """;

    public static final String LIST_OF_REASONS = """
            1.Животные в приюте очень радуются гостям и могут на Вас прыгнуть. Что бы не бояться испачкаться и не переживать возьмите с собой комплект сменной одежды и обуви.\s
            2.Животных угощать запрещено.
            3.В приюте обязательно слушайте, что говорит работник или волонтер. Никогда не открывайте калитки вольеров без разрешения!\s
            """;
    public static final String REQUIRED_DOCUMENTS = """
            1.Паспорт потенциального владельца,
            2.Фотографии квартиры или загородного дома где будет жить животное.
            3.Анкета (заполняется в приюте)
            """;

    public static final String DOG_CARRIAGE = """
            1. Для перевозки собки Вам потребуется намордник и поводок, плюс покрывало на сидения, пакеты и влажные салфетки.
            2. Для перевозки кошки подготовьте переноску по размеру животного. 
            3. Если время перевозки займет более 1 часа, приготовьте поилку и воду.
            """;

    public static final String PUPPY_SETUP = """
            Что понадобится щенку  в новом доме?
            1.Лежанка.
            2.Две миски: для воды и еды.
            3.Корм. По выбору корма можно проконсультироваться в приюте.
            4.Игрушки.
            5.Инструменты и аксессуары для груминга: когтерез, щетка, лосьон для чистки глаз и ушей, шампунь 
            и кондиционер для щенков, впитывающее полотенце.
            6.Аптечка. Базовая комплектация: термометр, самофиксирующиеся бинты, стерильные салфетки и 
            самофиксирующийся, дезинфицирующие средства без спирта, средство от диареи (сорбенты), 
            ранозаживляющая мазь, противопаразитарные средства, лосьон для чистки ушей и глаз.
            7.Обязательно узнайте адреса и телефоны нескольких ближайших ветеринарных клиник,
            8.Аксессуары для выгула: ошейник, поводок, шлейка, адресник. 
            При необходимости теплая одежда для прогулок и обувь.
            """;

//    public static final String ADULT_DOG_SETUP = """
//            Что понадобится собаке в новом доме?
//            1.Лежанка.
//            2.Две миски: для воды и еды.
//            3.Корм. По выбору корма можно проконсультироваться в приюте.
//            4.Игрушки.
//            5.Инструменты и аксессуары для груминга: когтерез, щетка, лосьон для чистки глаз и ушей, шампунь
//            и кондиционер для щенков, впитывающее полотенце.
//            6.Аптечка. Базовая комплектация: термометр, самофиксирующиеся бинты, стерильные салфетки и
//            самофиксирующийся, дезинфицирующие средства без спирта, средство от диареи (сорбенты),
//            ранозаживляющая мазь, противопаразитарные средства, лосьон для чистки ушей и глаз.
//            7.Обязательно узнайте адреса и телефоны нескольких ближайших ветеринарных клиник,
//            8. Для выгула: ошейник, при необходимости намордник, поводок, адресник.
//            При необходимости теплая одежда для прогулок и обувь.
//            """;

    public static final String ARRANGEMENT_OF_DOG_WITH_DISABILITIES = """
            Как организовать для питомца-инвалида максимально комфортную и безопасную среду.
            1. Уход за слепыми зверями.
            Если в доме содержится любимец с проблемным зрением, рекомендуется как можно реже
            проводить перестановку мебели, так как это затруднит его ориентацию в пространстве.
            Также не стоит без особой необходимости менять местоположение мисок с водой и кормом,
            подстилки, лотка. На полу и в пределах досягаемости нельзя оставлять вещи, в которых
            питомец может запутаться (например, одежду, полиэтиленовые пакеты-майки и т.д.).
            Доступ к лестнице, камину, нагревательным приборам и т.д. должен быть заблокирован.

            2. Уход за питомцами с ограниченной подвижностью.
            В первую очередь, необходимо обеспечить удобство передвижения по территории постоянного проживания.
            Если питомец волочит заднюю часть туловища, необходимо убрать с пола ковры, которые могут
            препятствовать движению. При этом для защиты конечностей от образования мозолей потребуется
            приобрести специальные фиксирующиеся накладки.
            Решить проблему туалета помогут специальные подгузники и одноразовые пеленки.
            В некоторых случаях для собаки или кота можно подобрать подходящую инвалидную коляску или ходунки.
            3. Важно! Для слепых или ограниченно подвижных животных категорически запрещен свободный выгул.
            4. Более подробные рекомендации можно получить у ветеринара.
             """;

    public static final String RULES_FOR_DATING_A_DOG = """
            Почему важно построить первоначальный контакт с собакой и как это сделать.
            1.	Разговаривайте со своей собакой.
            У собак хорошо развит слух, кроме того, они способны запоминать слова и
            связывать их с определенными явлениями.
            Собаки способны понимать, по меньшей мере, общий смысл человеческой речи.
            Люди, которые часто разговаривают со своей собакой, замечают, что собака начинает
            более осознанно реагировать на их слова и даже целые фразы.
            2.	 Следите за своими эмоциями.
            Быть членом общества — это значит уметь чутко реагировать на сигналы других членов
            своей группы и адекватно отвечать им.
            Собака ориентируется на эмоциональное состояние хозяина и других членов семьи.
            Применяя наказания, хозяин тоже создает эмоции — только негативные.
            В большом количестве эти эмоции разрушают контакт.
             """;

    public static final String CYNOLOGIST_ADVICE = """
            1.	Наблюдайте за выражением внутреннего состояния собаки и приводите его в норму.
             Внутреннее состояние собаки можно очень просто определить по ее сигналам. 
             Самые важные из них – сигналы примирения и симптомы стресса.
             - Если ваша собака неспокойна, постарайтесь сделать все возможное, чтобы успокоить ее. 
             Проще всего это сделать, если вы обратитесь к ней спокойным, дружеским тоном. 
             Нередко помогают лакомства или ласка.
             - На прогулке наблюдайте, с каким чувством она приближается к другой собаке. 
             Если моя собака или встречная собака показывает сигналы примирения или даже 
             симптомы стресса, старайтесь успокоить ситуацию. Для этого есть несколько вариантов реакции:
             Встать между своей собакой и собакой, которая к нам приближается;
             Остановиться на обочине дороги как можно дальше от приближающейся собаки и подождать, 
             пока она пройдет мимо;
             - Переключить внимание собаки на себя и в таком состоянии пройти мимо другой собаки;
             - После неприятной встречи старатесь сделать своей собаке что-то приятное: дать ей возможность 
             понюхать следы прошедшей мимо собаки, пописать на ее метку, поесть траву, поваляться в траве 
             или снять стресс каким-то другим действием.
             - Постарайтесь заранее понять, в каких ситуациях ваша собака начинает нервничать, 
             и какими методами можно ее быстро успокоить.
            2.	Учитывайте желания собаки.
             Не заставляйте собаку всегда делать только то, что хотите вы сами!
             Удовлетворить желания собаки очень просто:
             Предоставьте собаке выбор
             Например, если вы идете на прогулку, пронаблюдайте, в какую сторону хочет пойти ваша собака. 
             Может быть, она почувствовала в той стороне какой-то особый запах? Может быть, ее заинтересовали 
             какие-то места, к которым ведет новая дорога? Может быть, ее отпугнул от привычного пути 
             какой-то звук? Может быть, ей просто скучно все время ходить по одной и той же дороге каждый день?
             - Научитесь понимать сигналы, которыми собака выражает свои желания
            3. Гибко реагируйте на поведение собаки
             Каждая собака – индивидуум. Поведение собаки – это вовсе не спонтанный выстрел из ниоткуда. 
             Это результат гибкого взаимодействия внутреннего состояния собаки и окружающей среды.
            4. Ставьте границы допустимого без использования наказания
             Воспитание собаки невозможно пускать на самотек.
             Если же вам все-таки нужно подкорректировать поведение собаки, вы можете:
             - Обучить собаку альтернативным действиям (например, собаку приучают приносить игрушку 
             вместо того, чтобы прыгать на гостя);
             Лишить успеха от нежелательного действия (например, у собаки отбирают украденный со 
             стола кусок колбасы);
             Проигнорировать нежелательное действие (например, навязчивую попытку привлечь внимание);
             Остановить нежелательное действие различными способами, например, сигналом примирения 
             «разделение», «отворачивание», отзыв в сторону и т.д. 
            5.  Введите сигналы, которые вам помогут строить контакт
             Если хозяин любит свою собаку и заботится о ней, социальный контакт складывается сам по себе,
              в ходе повседневного общения. Этому во многом способствует генетическая предрасположенность
              собак строить контакт с людьми, искать его. Собаки от природы испытывают сильный интерес к людям. 
              Они склонны ориентироваться на людей, способны понимать их эмоции и указательные жесты и 
              направление взгляда. Тем не менее, полезно усилить это качество с помощью специальных упражнений.
              Указательный жест пальцем.
              Ведущая рука.
              Контакт глазами.
              Ритуалы повседневной жизни: ритуал встречи, ритуал прощания, ритуал перемирия,  
              Научите собаку задавать вам вопросы.
              Например, она будет поднимать на вас глаза, спрашивая, куда мы идем.
            6. На прогулке
             Во время прогулки общайтесь со своей собакой, 
             словно вы гуляете с другим членом своей семьи. Тогда собака будет следовать за вами более осмысленно.
             Как сделать из собаки приятного спутника:
             - Возьмите легкий поводок длиной от 3 метров.
             - Расслабьте мышцы рук и настройтесь на приятную прогулку.
            7. Дома и в гостях
               Показывайте своей собаке все предметы, которые ее заинтересуют
               Позволяйте ей быть рядом с вами и принимать участие в ваших делах
               Создайте ей уютное место, где бы она могла отдыхать без помех
               Радостно здоровайтесь с собакой при встрече со своей собакой.
            10. Ежедневно уделяйте собаке внимание – играйте с ней и ласкайте ее.
     
             """;
}
